{
  "metadata": {
    "total_size": 18239794688
  },
  "weight_map": {
    "model.embed_tokens.weight": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.0.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.0.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.0.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.1.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.1.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.1.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.2.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.2.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.2.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.2.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.3.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.3.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.3.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.3.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.4.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.4.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.4.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.4.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.5.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.5.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.5.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.5.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.6.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.6.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.6.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.6.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.7.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.7.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.7.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.7.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.8.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.8.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.8.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.8.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.9.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.9.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.9.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.9.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.10.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.10.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.10.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.10.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.11.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.11.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.11.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.11.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.12.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.12.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.12.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.12.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.13.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.13.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.13.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.13.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.14.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.14.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.14.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.14.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.15.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.15.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.15.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.15.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.v_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.o_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.o_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.o_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.o_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.o_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.o_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.16.self_attn.o_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.16.block_sparse_moe.gate.weight": "model-00001-of-00257.safetensors",
    "model.layers.16.input_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.16.post_attention_layernorm.weight": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.q_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.q_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.q_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.q_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.q_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.q_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.q_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.k_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.k_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.k_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.k_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.k_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.k_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.k_proj.meta.meta_zero.zero": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.v_proj.W_q": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.v_proj.meta.scale_q": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.v_proj.meta.meta_scale.scale": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.v_proj.meta.meta_scale.zero": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.v_proj.meta.zero_q": "model-00001-of-00257.safetensors",
    "model.layers.17.self_attn.v_proj.meta.meta_zero.scale": "model-00001-of-00257.safetensors",
